[
  {
    "id": 1,
    "title": "1. Rule of Thirds",
    "src": "https://www.photographyaxis.com/wp-content/uploads/Rule-of-Thirds.jpg",
    "description": "The first rule to learn as a beginner is the rule of thirds in photography. I would like to say that this rule emphasizes more on the position of the subjects in the frame. <br><br> According to this rule, you can position your subjects in any of the four intersecting points of the grid formed by two vertical and horizontal lines. <br><br> You can also align your subjects along any of these four lines. If you have a horizon level in the image, which is quite common in landscape images, you can place the horizon on any of these lines to draw the viewer’s attention. <br><br> This rule is of the popular types of composition in photography. <br><br> The bird (Snow Partridge) is framed using the rule of thirds. The two points of intersection of the grid lines, along with one vertical line fall on the bird’s body. The bird’s eye also lies on the top horizontal grid line."
  },
  {
    "id": 2,
    "title": "2. Leading Lines",
    "src": "https://www.photographyaxis.com/wp-content/uploads/Composing-with-Leading-Lines.jpg",
    "description": "Another useful technique to learn is leading lines photography. It is also easy-to-use rule.<br><br>You can make use of the different lines in the scene to lead toward your subject. Thus, the viewer’s attention can be easily drawn to the subject of interest.<br><br>These lines will be in different forms. It can be a road, rail, series of lampposts, a series of patterns, etc.<br><br>Here, the Photographer uses leading lines photography composition to do lens ball photography. The blurred tube lights along with the yellow marking line on the road and the series of pillars on either side act as the leading lines pointing toward the lens ball in hand."
  },
  {
    "id": 3,
    "title": "3. Use of Negative Space",
    "src": "https://www.photographyaxis.com/wp-content/uploads/Use-of-Negative-Space-in-Photo-Composition.jpg",
    "description": "You can also use the negative space technique. Here, the subjects will occupy less area of the frame. There will be more blank space which can be anywhere in the frame.<br><br>This rule is mainly used to create minimalist photographs. People who are looking to capture pictures for banner and poster designs also use this technique.<br><br>Here, the image of the bird, Chestnut-bellied Nuthatch is framed in such a way that there is a lot of negative space on the right-hand side.<br><br>"
  },
  {
    "id": 4,
    "title": "4. Fill the Frame",
    "src": "https://www.photographyaxis.com/wp-content/uploads/Fill-the-Frame-Photography-Composition.jpg",
    "description": "Fill the frame composing technique is another popular photo technique. You can use it for portraits, wildlife, birds, etc. Here, the subject occupies most of the frame.<br><br>In the case of portraits, it will be a tight portrait, without leaving much breathing space on the sides. This rule may not work for all types of scenes and situations.<br><br>Fill the frame type of composition in photography helps to capture and show more details of the subject.<br><br>The tight headshot image of this bird is a good example of the fill the frame technique."
  },
  {
    "id": 5,
    "title": "5. Keep It Simple",
    "src": "https://www.photographyaxis.com/wp-content/uploads/Keep-it-simple-photography-technique.jpg",
    "description": "The common photography mistakes made by most amateurs are trying to put more elements and their details in the frame. It often leads to lousy composition as it may distract the viewers’ attention to a different element in the scene.<br><br>So, try to use the, Keep it simple technique. It will make life easy for you.<br><br>The image of the ship in water is a good example. Here, the photographer uses the long exposure photography technique to make the sea calm that makes it look like a simple image of a ship without any distractions."
  },
  {
    "id": 6,
    "title": "6. Golden Ratio",
    "src": "https://www.photographyaxis.com/wp-content/uploads/Golden-Ratio-Photography-Composition.jpg",
    "description": "Golden ratio rule is also known by other names like Phi grids, Golden spiral, Fibonacci spiral, etc. It uses the Phi Grids or the Golden spiral to position the different elements in the scene. This grid may not be available in all cameras.<br><br>You can apply this rule either in the field or during photo editing. If you want to use it on the field and your camera doesn’t support it, still there is one way.<br><br>You can take a print out of the grid/spiral on a transparent plastic sheet. The size of the grid must match with the live view screen in your camera. Take a cut out of print and place it on top of the live view screen to use the rule.<br><br>In the above picture, the photographer has placed the house (the subject of interest) at the spiral end to follow this rule."
  },
  {
    "id": 7,
    "title": "7. Frame Within a Frame",
    "src": "https://www.photographyaxis.com/wp-content/uploads/Frame-within-a-Frame.jpg",
    "description": "The frame within a frame photo composition technique works best when the foreground border and the subject are in focus.<br><br>You can either expose both the foreground and the subject or the subject alone. It depends on you and also on the scene.<br><br>You can use the windows, doorways, aeroplane windows, etc., to try this technique. You can use it for portraits, landscape, architecture, and street photos.<br><br>Here, the photographer uses the window of his building to capture the city scene lying below, which is a good example of the frame within a frame technique."
  },
  {
    "id": 8,
    "title": "8. Composing with Lines: Horizontal",
    "src": "https://www.photographyaxis.com/wp-content/uploads/Composing-with-Horizontal-Lines.jpg",
    "description": "Horizontal lines in the frame can be used for composition. These lines will make the viewer’s eye move from left to right of the frame. The frame will look more attractive if you can include your subject in this type of line in your photography composition.<br><br>Here, the yellow building sections act as the horizontal lines that aid in the photo composition. The windows along with the air conditioner are the different elements in the scene."
  },
  {
    "id": 9,
    "title": "9. Composing with Lines: Vertical",
    "src": "https://www.photographyaxis.com/wp-content/uploads/Composing-with-Verticla-Lines.jpg",
    "description": "If you are doing forest photography or architecture photography, you can use vertical lines in the composition scene. In the case of the forest, you will have vertical lines in the form of trees.<br><br>You can use buildings and tall skyscrapers as vertical lines for architectural images. The vertical elements can be anything else also.<br><br>Photographer, Niilo Isotalo, uses the vertical lines composing technique with the help of the tall trees inside the forest."
  },
  {
    "id": 10,
    "title": "10. Rule of Diagonals",
    "src": "https://www.photographyaxis.com/wp-content/uploads/Composing-with-Diagonals.jpg",
    "description": "You can use the diagonal lines in the scene to compose frames. The diagonal lines tend to produce strong images than the horizontal and vertical lines.<br><br>The diagonal which connects the opposite corners of the frame must not be used. It will not help to create beautiful images.<br><br>Too many diagonals in the frame can create tension. So, try to avoid that too."
  },
  {
    "id": 11,
    "title": "11. Composing with Horizon Line",
    "src": "https://www.photographyaxis.com/wp-content/uploads/Composing-with-Horizons.jpg",
    "description": "Most landscape and architecture photographers use the composition with the horizon line rule in their images.<br><br>The horizon line can be anything. It can be the line separating the sea from land, land from the sky, mountains from the sky, etc. Try to get a perfect level horizon. The photo will look best if the horizon line is parallel to it.<br><br>Here, the line separating the sea and the cloud-studded sky is the horizon line, which is framed parallel to the frame to create this image."
  },
  {
    "id": 12,
    "title": "12. Golden Triangle Composition",
    "src": "https://www.photographyaxis.com/wp-content/uploads/Golden-Triangles-Image-Composition.jpg",
    "description": "The Golden triangle photography rule is a famous composition technique used by both painters and photographers. This technique uses a grid formed by a diagonal line in the frame along with two perpendicular bisectors of the diagonal line from the other corners.<br><br>You must place your subjects in any/two-point of intersections of these lines to follow this rule. Here, the whole frame gets divided into four triangles. You can also align your subjects along these lines or inside the triangles.<br><br>In this food image, you can see that the two intersection points coincide with the center food bowl (main subject). The supporting fruit bowl along with the main bowl and the spoon are aligned along the diagonal."
  },
  {
    "id": 13,
    "title": "13. S-curve Photography Composition",
    "src": "https://www.photographyaxis.com/wp-content/uploads/Composing-with-S-Curves.jpg",
    "description": "You can also make use of the S curve in the scene to compose your shots. The picture will look great if the S curve can lead to your subject. Thus, it is easy to draw the viewer’s eye.<br><br>The S-curve can be a road, rail, or a series of houses, trees, etc. You need to find the elements and the camera angle to get such a curve in the scene.<br><br>In this picture, it is a flipped S-curve formed by the road, which directs the viewer’s eye to the mountains."
  },
  {
    "id": 14,
    "title": "14. Composing with Curves",
    "src": "https://www.photographyaxis.com/wp-content/uploads/Composing-with-Curves.jpg",
    "description": "You may not have S-curves in all the scenes. Some frames may have curves in different shapes like “C”, “U”, etc. You can use these curves to your advantage.<br><br>Try to bring your subject at the end of the curve or along with the curve. If you have multiple subjects, then try to connect everything using these curves. It can also act as the dividing element, especially for drone shots.<br><br>The water body in the shape of a curve makes the image attractive."
  },
  {
    "id": 15,
    "title": "15. Composing with Colors",
    "src": "https://www.photographyaxis.com/wp-content/uploads/Composing-with-Colors.jpg",
    "description": "You can also compose images with colors. Vibrant colors help to emphasize the contrast. Saturated colors easily attract the viewer’s attention. Different colors gives a different feel and emotion to the picture.<br><br>Green shows hope as it is linked to Nature. Desaturated colors will help to provide a soft look. Muted colors in an image will help to create a long-lasting impact than strong ones.<br><br>The vibrant red color is the predominant one in the scene. It makes the yellow door and the black and white cycle very interesting.<br><br>You can use the color wheel to get your color combinations.<br><br>Some of the popular color combinations that work well for images include complementary, analogous, split complementary, and triadic colors."
  },
  {
    "id": 16,
    "title": "16. Juxtaposition in Photography",
    "src": "https://www.photographyaxis.com/wp-content/uploads/Juxtaposition-example-Mirrorless-Vs-FIlm-camera.jpg",
    "description": "When you put two contrasting subjects together in a frame, then we can apply the Juxtaposition rule to the picture.<br><br>It can be male vs female, rectangle vs square, new vs old, fat vs thin, kid vs adult, etc. If you come across such contrasting subjects, try this rule.<br><br>The image of an old film camera vs the new mirrorless camera is a good example of the Juxtaposition technique."
  },
  {
    "id": 17,
    "title": "17. Repetition Photography Composition",
    "src": "https://www.photographyaxis.com/wp-content/uploads/Repetiton-photo-composition.jpg",
    "description": "If you have repetitive patterns in the scene, then you can use the repletion composition technique.<br><br>Some of the situations where you can use this rule include a crowd, sand pattern, bricks, a stack of fruits, windows, chairs, ripples in water, etc.<br><br>Here, Photographer Nacho Capelo has captured a frame with orange chairs using the repetition composition technique."
  },
  {
    "id": 18,
    "title": "18. Balance in Photography",
    "src": "https://www.photographyaxis.com/wp-content/uploads/Balance-in-Photography.jpg",
    "description": "The term “Balance” comes in composition when you have two or more subjects in the frame. There are four key ways to achieve this balance. They are symmetrical balance, asymmetrical balance, balance on the vertical axis, and balance on the horizontal axis.<br><br>Symmetrical balance is created by two subjects in a scene of similar size. Subjects of different sizes create asymmetrical balance.<br><br>Here, the rocks in the foreground appear to be larger in size than the rocks on the backside, which makes the entire frame balanced."
  },
  {
    "id": 19,
    "title": "19. Texture in Photography",
    "src": "https://www.photographyaxis.com/wp-content/uploads/Texture-on-Wall.jpg",
    "description": "Using the textures in the scene is an excellent way of composing pictures. The texture can be anything. It includes tree bark, building walls, paper, sand, rope, mountains, leaves, etc.<br><br>If you are using an interchangeable lens camera, use a macro lens to get the maximum texture details. Exciting textures can create beautiful images.<br><br>An image of the texture of the paint on the wall is shown above."
  },
  {
    "id": 20,
    "title": "20. Symmetry in Composition",
    "src": "https://www.photographyaxis.com/wp-content/uploads/Symmetry-Composition.jpg",
    "description": "You can make use of symmetry in the scene to compose photos. When you divide the picture horizontally or vertically along the center, if one side reflects the other, then we can say that the image is using symmetrical composition.<br><br>The other side need not be an exact reflection copy. You can use this rule for water reflection photography. Buildings and structures are two other good subjects to create such images.<br><br>The above image of the building from a  worm’s eye perspective, captured inside the building makes an interesting composition. This image is symmetrical along both the horizontal axis as well as the vertical axis."
  },
  {
    "id": 21,
    "title": "21. Composing with Foreground Interest",
    "src": "https://www.photographyaxis.com/wp-content/uploads/Composing-with-Foreground.jpg",
    "description": "You can use the foreground elements in your scene to make interesting compositions. If the middleground and the background elements are less attractive, then the use of foreground elements will help to make the image more pleasing.<br><br>In this case, you must also double-check the image exposure. Sometimes, the elements in the foreground can go dark, and the details will not be visible. So, you will have to go for the fill-in flash technique or the HDR.<br><br>The use of flowers in the foreground made the image with tall skyscrapers and the lake in between more beautiful."
  },
  {
    "id": 22,
    "title": "22. Composing with Background",
    "src": "https://www.photographyaxis.com/wp-content/uploads/Double-Humped-Camel-in-its-habitat.jpg",
    "description": "Sometimes, the background makes the picture more dynamic and lively. But, you must ensure that the background is not dominating the picture.<br><br>When you take a picture of a person in his working environment, the background plays a significant role in depicting his environment. So, you must capture the background details also.<br><br>Here, you will have to shoot with a wide-angle lens with a narrow aperture opening to get the background also in focus.<br><br>I have captured this image of the Double-humped camel in its habitat, which comprises the mountains and shrubs in the desert."
  },
  {
    "id": 23,
    "title": "23. Light & Shadow Photography Composition",
    "src": "https://www.photographyaxis.com/wp-content/uploads/Light-and-Shadow-Composition.jpg",
    "description": "The Light and Shadow technique is popular in the early days of photography also.<br><br>Here, the light will be falling on the subjects of interest, and the other areas of the scene will be predominantly covered by shadows. The light can be natural or artificial.<br><br>In this image, the light is falling on the bird’s head, and I underexposed the photo by 2 stops to get such a result. So, the viewer’s eye is drawn to the head without any distractions."
  },
  {
    "id": 24,
    "title": "24. Triangle Composition",
    "src": "https://www.photographyaxis.com/wp-content/uploads/Triangle-Composition.jpg",
    "description": "The triangle composition method is another exciting rule. It uses the triangle shape formed in the scene.<br><br>The triangle shape can be formed in different ways. If there are three subjects in the scene, then you can frame it in such a way the subjects form the vertices of a triangle. If you can connect 3 interesting points in a frame in a triangle structure, then you can use this technique.<br><br>Photographer, Valerie Elash uses the triangle photo composition rule for the picture, where the three women form the 3 vertices of the triangle."
  },
  {
    "id": 25,
    "title": "25. Subject Isolation using Depth of Field",
    "src": "https://www.photographyaxis.com/wp-content/uploads/Subject-Isolation-with-Depth-of-Field.jpg",
    "description": "Isolating the subject is a common technique used by portrait, fashion, wildlife, and bird photographers.<br><br>Here, the photographer uses a shallow depth of field to make the subject stand out in their environment. Large focal lengths and wide aperture opening help to achieve this result.<br><br>In the above image, the viewer’s eye is easily drawn to the bird perched on the rock without any distraction. The 500mm telephoto length and the use of a wide aperture of f4.0 have made it possible to get a nice background blur."
  },
  {
    "id": 26,
    "title": "26. Changing Vantage Point",
    "src": "https://www.photographyaxis.com/wp-content/uploads/Low-Angle-Vantage-Point.jpg",
    "description": "Sometimes, changing the vantage point can help you to get better compositions.<br><br>Certain frames look good from a birds eye view than the eye level view. Some other scenes look best in worms eye view.<br><br>So, you must try to visualize the same scene from different camera angles to see what is best for the scene. You may have to use a drone for getting an aerial perspective.<br><br>Here, the use of worms eye view helped to create this interesting photo composition of the building."
  },
  {
    "id": 27,
    "title": "27. Radial Balance Photography Composition",
    "src": "https://www.photographyaxis.com/wp-content/uploads/Radial-Balalnce-Example-Star-Trails.jpg",
    "description": "You can use the radial balance technique to create images that radiate outwards, not necessarily from the centre. Photographers use this technique to photograph star trails, flower photography, radial patterns in architecture and buildings, etc.<br><br>It helps to bring a perfect balance to the frame. The centre of the radial pattern can be in the centre of the frame or at a different place.<br><br>Steel wool photography is a perfect example of the radial balance technique.<br><br>Here, the long exposure photography technique is used to create these star trails which have got a radial view."
  },
  {
    "id": 28,
    "title": "28. Subject Centering",
    "src": "https://www.photographyaxis.com/wp-content/uploads/Centering-the-Subject.jpg",
    "description": "Centering the subject does not work for all types of pictures. But, there are situations where it works best. It works for many portrait shots.<br><br>If you plan to include the person’s environment or looking for a nice background blur, then this may work. It helps direct the viewer’s eye to the subject without any distractions.<br><br>In this photo, the lady occupies the centre part of the image with beautiful white flowers on either side."
  },
  {
    "id": 29,
    "title": "29. Depth with Subjects at Different Distances",
    "src": "https://www.photographyaxis.com/wp-content/uploads/Depth-with-Subjects-at-Different-Distances.jpg",
    "description": "The technique of creating more depth in the scene is used commonly by Landscape photographers. You can use a wide-angle lens along with a narrow aperture to get this effect.<br><br>Use the Hyperfocal distance to get a wide Depth of Field. It will ensure that the subjects in foreground, middleground, and background are in focus.<br><br>The use of a narrow aperture helped to keep both the house in the foreground, trees, and lake in the middle ground, and the mountains in the background in focus. Thus, more depth is created in the image."
  },
  {
    "id": 30,
    "title": "30. Depict Motion of Subjects",
    "src": "https://www.photographyaxis.com/wp-content/uploads/Motion-Blur-to-Depict-Motion-in-the-Scene.jpg",
    "description": "You can compose images by depicting motion in the scene. You can do it either by panning shot method or by you can long exposure photography. Such photos will give a sense of motion to the viewer.<br><br>In this image, Photographer Ahmad Odeh uses the long exposure technique to create a motion effect of the dancer, visible in the form of motion blur."
  },
  {
    "id": 31,
    "title": "31. Interaction – Story-Telling Images",
    "src": "https://www.photographyaxis.com/wp-content/uploads/Story-Telling-Images.jpg",
    "description": "A great way to bring pictures to life is to capture storytelling images. By looking at the picture, the viewer must able to see the action that is going on.<br><br>The image by Matty Adame is an excellent example of a storytelling scene. Anyone who sees the picture can interpret that the crowd is enjoying the music played by the DJs, while the cameraman is busy capturing the footage."
  },
  {
    "id": 32,
    "title": "32. Landscape Vs Portrait Orientation",
    "src": "https://www.photographyaxis.com/wp-content/uploads/Landscape-vs-portrait-orientation.jpg",
    "description": "You can capture pictures in landscape and portrait orientation. Some photos look best in one orientation than the other. So, try composing with both orientation to see which one suits the frame and select accordingly.<br><br>I have cropped the image of the Rock bunting bird into portrait orientation (original image in landscape orientation), to show the difference between the two. The bird details are more visible in the portrait orientation."
  },
  {
    "id": 33,
    "title": "33. Rule Of Odds",
    "src": "https://www.photographyaxis.com/wp-content/uploads/Rule-of-Odds-3-kids-in-Frame.jpg",
    "description": "The rule of odds deals with the number of subjects in the picture. According to this rule, the photo will be more pleasing to the viewer if there are an odd number of subjects.<br><br>In the above picture, we can see three kids (odd number) that satisfy this rule. This rule works for odd numbers like 3,5, and 7. You may not be able to use this rule all the time for your photos."
  }
]